source/chess.org

This is where the chess stuff will be. 



* Opening Lines

** 1. e4 e5

*** Scotch

| e4   | e5   |                                                                                                                                             |
| Nf3  | Nc6  |                                                                                                                                             |
| d4   | exd4 |                                                                                                                                             |
| Nxd4 |      | Here, black can continue with Nf6 or Bc5.                                                                                                   |
|      | Bc5  | White can continue with Be3, Nb3, or Nxc6                                                                                                   |
| Be3  | Qf6  | Here, Qf6 is a good system, with Ne7 following. Another move is Bb6. At this point if Nxc6, then Bxe3 threatens mate and is good for black. |
|      |      |                                                                                                                                             |


*** Four Knights Scotch

Line 1:
| e4   | e5   |                          |
| Nf3  | Nc6  |                          |
| Nc3  | Nf6  |                          |
| d4   | Bb4  |                          |
| Nxe5 | Nxe4 |                          |
| Qf3  | Nf6  |                          |
| Be3  | 0-0  |                          |
| Bd3  | Re8  |                          |
| 0-0  |      | and here, white is fine. |
|      |      |                          |

Alternatively,
4.. exd4
5. [@5] Nxd4 Nxd4 is a mistake.
6. Qxd4


Once the queen enters the center white has a lot of control.
Here, d6 is necessary to stop e5.

Lots of people play c5 trying to attack the queen, but Qa4 prevents d6 and prepares e5.
Can put the light squared bishop on c4 (e4 pawn is defended well enough).
If no squares are appealing, can even fianchetto the bishop.


**** Line 2:
1. e4 e5
2. Nf3 Nc6
3. Nc3 Bc5?!
4. Nxe5 Bxf2


Bxf2 is a classic mistake. Black has given up lots of tempi AND the dark square bishop.

5. [@5] Kxf2 Nxe5
6. d4 Qf6+
7. Kg1 Ng6


At this point, white can go with the quiet Be3 and Qd2. White can also go with e5. Nd5 is not great
because it sends the queen back to d8 and invites c6.

8. [@8] Be3 Ne7
Here, Bd3 Nf4 is annoying, so Qd2 instead.

9. [@9] Qd2 0-0
10. Bc4 d6 loses a queen.
11. Bg5!




** 1. e4 c5




** 1. d4
♔
♞

After 1. d4 d5 2. c4, there are a number of lines. Here are a few:
- Semi-Slav Defense (e6 with eventual c6)
- Slav Defense (c6)
- Albin Countergambit (e5)
- Chigorin Defense (Nc6)
- Baltic Defense (Bf5)
- Symmetrical/Austrian Defense (c5)
- Marshall Defense (Nf6)

*** Queen's Gambit Declined
From wikipedia: White will try to exploit the passivity of Black's light-squared bishop, and Black
will try to release it, trade it, or prove that, while passive, the bishop has a useful defensive
role.

Black will usually not take dxc4 as that surrenders the control of the center. However, he might do
so if he can extract a tempo (eg. if White has already played Bd3). 

1. d4 d5
2. c4 e6


Mainline:
3. [@3] Nc3 Nf6
4. Bg5 Be7
5. Nf3 h6
6. Bxf6 Bxf6
7. e3
   





* Important Games
