docs/chess.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-12 Thu 21:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Narayan" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org37aadcd">1. Opening Lines</a>
<ul>
<li><a href="#org9f8d48e">1.1. 1. e4 e5</a>
<ul>
<li><a href="#org6f423b1">1.1.1. Scotch</a></li>
<li><a href="#org3d49608">1.1.2. Four Knights Scotch</a></li>
</ul>
</li>
<li><a href="#org7082377">1.2. 1. e4 c5</a></li>
<li><a href="#org927fa6b">1.3. 1. d4</a>
<ul>
<li><a href="#orgfd0dc0e">1.3.1. Queen's Gambit Declined</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc4d10e9">2. Important Games</a></li>
</ul>
</div>
</div>
<p>
This is where the chess stuff will be. 
</p>



<div id="outline-container-org37aadcd" class="outline-2">
<h2 id="org37aadcd"><span class="section-number-2">1.</span> Opening Lines</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9f8d48e" class="outline-3">
<h3 id="org9f8d48e"><span class="section-number-3">1.1.</span> 1. e4 e5</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6f423b1" class="outline-4">
<h4 id="org6f423b1"><span class="section-number-4">1.1.1.</span> Scotch</h4>
<div class="outline-text-4" id="text-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">e4</td>
<td class="org-left">e5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nf3</td>
<td class="org-left">Nc6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">d4</td>
<td class="org-left">exd4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nxd4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Here, black can continue with Nf6 or Bc5.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Bc5</td>
<td class="org-left">White can continue with Be3, Nb3, or Nxc6</td>
</tr>

<tr>
<td class="org-left">Be3</td>
<td class="org-left">Qf6</td>
<td class="org-left">Here, Qf6 is a good system, with Ne7 following. Another move is Bb6. At this point if Nxc6, then Bxe3 threatens mate and is good for black.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org3d49608" class="outline-4">
<h4 id="org3d49608"><span class="section-number-4">1.1.2.</span> Four Knights Scotch</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Line 1:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">e4</td>
<td class="org-left">e5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nf3</td>
<td class="org-left">Nc6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nc3</td>
<td class="org-left">Nf6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">d4</td>
<td class="org-left">Bb4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nxe5</td>
<td class="org-left">Nxe4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Qf3</td>
<td class="org-left">Nf6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Be3</td>
<td class="org-left">0-0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Bd3</td>
<td class="org-left">Re8</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">0-0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">and here, white is fine.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Alternatively,
4.. exd4
</p>
<ol class="org-ol">
<li value="5">Nxd4 Nxd4 is a mistake.</li>
<li>Qxd4</li>
</ol>


<p>
Once the queen enters the center white has a lot of control.
Here, d6 is necessary to stop e5.
</p>

<p>
Lots of people play c5 trying to attack the queen, but Qa4 prevents d6 and prepares e5.
Can put the light squared bishop on c4 (e4 pawn is defended well enough).
If no squares are appealing, can even fianchetto the bishop.
</p>
</div>


<ol class="org-ol">
<li><a id="org1e9d8fe"></a>Line 2:<br />
<div class="outline-text-5" id="text-1-1-2-1">
<ol class="org-ol">
<li>e4 e5</li>
<li>Nf3 Nc6</li>
<li>Nc3 Bc5?!</li>
<li>Nxe5 Bxf2</li>
</ol>


<p>
Bxf2 is a classic mistake. Black has given up lots of tempi AND the dark square bishop.
</p>

<ol class="org-ol">
<li value="5">Kxf2 Nxe5</li>
<li>d4 Qf6+</li>
<li>Kg1 Ng6</li>
</ol>


<p>
At this point, white can go with the quiet Be3 and Qd2. White can also go with e5. Nd5 is not great
because it sends the queen back to d8 and invites c6.
</p>

<ol class="org-ol">
<li value="8">Be3 Ne7</li>
</ol>
<p>
Here, Bd3 Nf4 is annoying, so Qd2 instead.
</p>

<ol class="org-ol">
<li value="9">Qd2 0-0</li>
<li>Bc4 d6 loses a queen.</li>
<li>Bg5!</li>
</ol>
</div>
</li>
</ol>
</div>
</div>




<div id="outline-container-org7082377" class="outline-3">
<h3 id="org7082377"><span class="section-number-3">1.2.</span> 1. e4 c5</h3>
</div>




<div id="outline-container-org927fa6b" class="outline-3">
<h3 id="org927fa6b"><span class="section-number-3">1.3.</span> 1. d4</h3>
<div class="outline-text-3" id="text-1-3">
<p>
♔
♞
</p>

<p>
After 1. d4 d5 2. c4, there are a number of lines. Here are a few:
</p>
<ul class="org-ul">
<li>Semi-Slav Defense (e6 with eventual c6)</li>
<li>Slav Defense (c6)</li>
<li>Albin Countergambit (e5)</li>
<li>Chigorin Defense (Nc6)</li>
<li>Baltic Defense (Bf5)</li>
<li>Symmetrical/Austrian Defense (c5)</li>
<li>Marshall Defense (Nf6)</li>
</ul>
</div>

<div id="outline-container-orgfd0dc0e" class="outline-4">
<h4 id="orgfd0dc0e"><span class="section-number-4">1.3.1.</span> Queen's Gambit Declined</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
From wikipedia: White will try to exploit the passivity of Black's light-squared bishop, and Black
will try to release it, trade it, or prove that, while passive, the bishop has a useful defensive
role.
</p>

<p>
Black will usually not take dxc4 as that surrenders the control of the center. However, he might do
so if he can extract a tempo (eg. if White has already played Bd3). 
</p>

<ol class="org-ol">
<li>d4 d5</li>
<li>c4 e6</li>
</ol>


<p>
Mainline:
</p>
<ol class="org-ol">
<li value="3">Nc3 Nf6</li>
<li>Bg5 Be7</li>
<li>Nf3 h6</li>
<li>Bxf6 Bxf6</li>
<li>e3</li>
</ol>
</div>
</div>
</div>
</div>






<div id="outline-container-orgc4d10e9" class="outline-2">
<h2 id="orgc4d10e9"><span class="section-number-2">2.</span> Important Games</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Narayan</p>
<p class="date">Created: 2023-10-12 Thu 21:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
